src/Catalogs/кфкКаналыСпецификации/кфкКаналыСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкКаналыСпецификации</name>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>CatalogRef.кфкТипыДанныхСпецификации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.кфкПриложенияСпецификаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкСпецификации/кфкСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкСпецификации</name>
  <owners>Catalog.кфкПриложенияСпецификаций</owners>
  <attributes>
    <name>ПрефиксАдреса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксАдреса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбмена</name>
    <type>
      <types>CatalogRef.Конвертации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/кфкКаналыСпецификации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = АдресКанала(Объект.Владелец, Объект.ТипДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	Адрес = АдресКанала(Объект.Владелец, Объект.ТипДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция АдресКанала(Спецификация, ТипДанных)
	
	Если Спецификация.Пустая() Или ТипДанных.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.ПрефиксАдреса КАК ПрефиксАдреса,
	|	Т.ПостфиксАдреса КАК ПостфиксАдреса
	|ИЗ
	|	Справочник.кфкСпецификации КАК Т
	|ГДЕ
	|	Т.Ссылка = &Спецификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Код КАК Код
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т
	|ГДЕ
	|	Т.Ссылка = &ТипДанных";
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСпецификации = РезультатЗапроса[0].Выбрать();
	ВыборкаТипа = РезультатЗапроса[1].Выбрать();
	
	Если ВыборкаСпецификации.Следующий() И ВыборкаТипа.Следующий() Тогда
		Возврат ВыборкаСпецификации.ПрефиксАдреса + ВыборкаТипа.Код + ВыборкаСпецификации.ПостфиксАдреса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
